def canon(xc, yc, R):
    """
        Отрисовка окружности по
        каноническому уравнению
    """
    print("Ммм, канон!", xc, yc, R)


def parametric(xc, yc, R):
    """
        Отрисовка окружности по
        параметрическому уравнению
    """
    print("Все связано", xc, yc, R)


def brezenham(xc, yc, R):
    """
        Отрисовка окружности
        алгоритмом Брезенхема
    """
    print("От него не спрятаться", xc, yc, R)


def midpoint(xc, yc, R):
    """
        Отрисовка окружности
        алгоритмом средней точки
    """
    print("Золотая середина", xc, yc, R)


def libfunc(xc, yc, R):
    """
        Отрисовка окружности
        библиотечной функции
    """
    print("Все ради этого", xc, yc, R)